<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1cff16f9d94bacfc2420a052eda20a2ef22b4cae37bf60c80ef0a794279e57bf","plan_job_ref":"Job Environment Main - Plan #52 at https://github.com/jarrod-lowe/wildsea/actions/runs/10400011760","plan_out_hash":"fd2b06be5a4ff3605b875a90f535f93f0886612a5e8fe1410ce8afaa6f9f2d4f","plan_hash":"91c27719af05096b1717b6974ca2e7f4c2f85c9b148a0f5d2321d0916d4c0417","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 3 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.cognito_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cognito_assume" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRoleWithWebIdentity",
            ]
+           effect  = "Allow"

+           condition {
+               test     = "ForAnyValue:StringLike"
+               values   = [
+                   "authenticated",
                ]
+               variable = "cognito-identity.amazonaws.com:amr"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "ap-southeast-2:2c578a4f-3fd8-453e-860d-4fde2187c38e",
                ]
+               variable = "cognito-identity.amazonaws.com:aud"
            }

+           principals {
+               identifiers = [
+                   "cognito-identity.amazonaws.com",
                ]
+               type        = "Federated"
            }
        }
    }

  # module.wildsea.data.local_file.graphql_code["createGame"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_file" "graphql_code" {
+       content              = (known after apply)
+       content_base64       = (known after apply)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "../../../graphql/mutation/createGame/appsync.js"
+       id                   = (known after apply)
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                   = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                 = "Wildsea-primary"
!~      schema               = <<-EOT
            type Mutation {
          -     createGame(input: CreateGameInput!): Game!
          +     createGame(input: CreateGameInput!): Game! @aws_cognito_user_pools
            }
            
            type Query {
          -     getGame(input: ID!): Game!
          +     getGame(input: ID!): Game! @aws_cognito_user_pools
            }
            
            input CreateGameInput {
                name: String!
                description: String
          -     publicNotes: String
          -     privateNotes: String
          -     fireflyUserId: ID!
          -     players: [ID!]!
            }
            
          - type Game {
          + type Game @aws_cognito_user_pools {
              id: ID!
              name: String!
              description: String
              publicNotes: String
              privateNotes: String
            #  fireflyUser: User!
            #  players: [ID!]!
            #  playerSheets: [PlayerSheet!]!
            #  shipSheet: ShipSheet
            #  clocks: [Clock!]!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
        EOT
        tags                 = {
            "Name" = "Wildsea-primary"
        }
#        (9 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["createGame"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = (known after apply)
+       data_source = "Wildsea_primary"
+       field       = "createGame"
+       id          = (known after apply)
+       kind        = "UNIT"
+       type        = "Mutation"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_cognito_identity_pool.cognito will be updated in-place
!~  resource "aws_cognito_identity_pool" "cognito" {
        id                               = "ap-southeast-2:2c578a4f-3fd8-453e-860d-4fde2187c38e"
        tags                             = {}
#        (9 unchanged attributes hidden)

-       cognito_identity_providers {
-           client_id               = "226ffqsmo9k9svmdjoh9djdkom" -> null
-           provider_name           = "cognito-idp.ap-southeast-2.amazonaws.com/ap-southeast-2_mi8U4SiYJ" -> null
-           server_side_token_check = true -> null
        }
+       cognito_identity_providers {
+           client_id               = (known after apply)
+           provider_name           = "cognito-idp.ap-southeast-2.amazonaws.com/ap-southeast-2_mi8U4SiYJ"
+           server_side_token_check = true
        }
    }

  # module.wildsea.aws_cognito_user_pool_client.cognito must be replaced
-/+ resource "aws_cognito_user_pool_client" "cognito" {
!~      access_token_validity                         = 0 -> (known after apply)
!~      auth_session_validity                         = 3 -> (known after apply)
!~      client_secret                                 = (sensitive value)
+       default_redirect_uri                          = (known after apply)
!~      enable_propagate_additional_user_context_data = false -> (known after apply)
!~      enable_token_revocation                       = true -> (known after apply)
!~      generate_secret                               = true -> false # forces replacement
!~      id                                            = "**************************" -> (known after apply)
!~      id_token_validity                             = 0 -> (known after apply)
        name                                          = "Wildsea-primary"
+       prevent_user_existence_errors                 = (known after apply)
!~      read_attributes                               = [] -> (known after apply)
!~      refresh_token_validity                        = 30 -> (known after apply)
!~      write_attributes                              = [] -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_role.cognito will be updated in-place
!~  resource "aws_iam_role" "cognito" {
!~      assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRoleWithWebIdentity"
-                       Condition = {
-                           "ForAnyValue:StringLike" = {
-                               "cognito-identity.amazonaws.com:amr" = "*************"
                            }
-                           StringEquals             = {
-                               "cognito-identity.amazonaws.com:aud" = "***************************************************"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "Wildsea-primary-user"
        name                  = "Wildsea-primary-user"
        tags                  = {}
#        (11 unchanged attributes hidden)
    }

  # module.wildsea.null_resource.graphql_compile["createGame"] will be created
+   resource "null_resource" "graphql_compile" {
+       id       = (known after apply)
+       triggers = {
+           "dest_file"     = "../../../graphql/mutation/createGame/appsync.js"
+           "source_change" = "ee27cb9eac98bc9c221456fdcffbc9f6f4fd14bf52b5deae7388b63a95c9662d"
        }
    }

Plan: 3 to add, 3 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #52](https://github.com/jarrod-lowe/wildsea/actions/runs/10400011760)